In [30]:
import pandas as pd
import  numpy as np

In [31]:
data = {
    "Patient_ID": [1, 2, 3, 4, 5],
    "Patient _name": ["John", "Jane", "Jim", "Jill", "Jack"],
    "Age": [44, 33, 38, 32, 36],
    "Admission Type": ["OPD", "OPD", "Emergency", "OPD", "Emergency"],
}

In [32]:
df= pd.DataFrame(data)
df

   Patient_ID Patient _name  Age Admission Type
0           1          John   44            OPD
1           2          Jane   33            OPD
2           3           Jim   38      Emergency
3           4          Jill   32            OPD
4           5          Jack   36      Emergency

In [45]:
np.random.seed(41)
n=100
df=pd.DataFrame({"Patient_ID": np.random.randint(10,20,n),
    "Patient _name": np.random.choice(["John", "Jane", "Jim", "Jill", "Jack"],n),
    "Age": np.random.randint(20,80,n),
    "Admitted Type": np.random.choice(["OPD", "IPD"],n)
})

In [34]:
df

    Patient_ID Patient _name  Age Admitted typeon Type
0           10           Jim   54                  OPD
1           13          John   28                  IPD
2           12           Jim   60                  IPD
3           10           Jim   56                  IPD
4           11          Jack   61                  IPD
..         ...           ...  ...                  ...
95          12          Jill   55                  OPD
96          11          John   22                  IPD
97          10          Jill   41                  OPD
98          11          Jane   59                  OPD
99          11          Jane   35                  OPD

[100 rows x 4 columns]

In [35]:

# VALIDATION APPLY ON Patient Name and Age must be greater than 0
valid_name = ["John", "Jane", "Jim", "Jill", "Jack"]


df=df[df["Patient _name"].isin(valid_name)]
df

    Patient_ID Patient _name  Age Admitted typeon Type
0           10           Jim   54                  OPD
1           13          John   28                  IPD
2           12           Jim   60                  IPD
3           10           Jim   56                  IPD
4           11          Jack   61                  IPD
..         ...           ...  ...                  ...
95          12          Jill   55                  OPD
96          11          John   22                  IPD
97          10          Jill   41                  OPD
98          11          Jane   59                  OPD
99          11          Jane   35                  OPD

[100 rows x 4 columns]

In [36]:
df=df[df["Age"].between(0,60)]
df

    Patient_ID Patient _name  Age Admitted typeon Type
0           10           Jim   54                  OPD
1           13          John   28                  IPD
2           12           Jim   60                  IPD
3           10           Jim   56                  IPD
9           18          Jack   48                  OPD
..         ...           ...  ...                  ...
95          12          Jill   55                  OPD
96          11          John   22                  IPD
97          10          Jill   41                  OPD
98          11          Jane   59                  OPD
99          11          Jane   35                  OPD

[70 rows x 4 columns]

In [37]:
#Task 3 Treatment charge entry
df['Treatment_Charge'] = np.random.randint(50,20000,size=len(df))

C:\Users\r\AppData\Local\Temp\ipykernel_4068\3619145906.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Treatment_Charge'] = np.random.randint(50,20000,size=len(df))

In [38]:
df

    Patient_ID Patient _name  Age Admitted typeon Type  Treatment_Charge
0           10           Jim   54                  OPD             10874
1           13          John   28                  IPD             10951
2           12           Jim   60                  IPD              5816
3           10           Jim   56                  IPD              1851
9           18          Jack   48                  OPD              8387
..         ...           ...  ...                  ...               ...
95          12          Jill   55                  OPD              4262
96          11          John   22                  IPD               481
97          10          Jill   41                  OPD              5718
98          11          Jane   59                  OPD              1042
99          11          Jane   35                  OPD              5927

[70 rows x 5 columns]

In [39]:
#store charge in list
charge_list = df['Treatment_Charge'].tolist()

In [40]:
df

    Patient_ID Patient _name  Age Admitted typeon Type  Treatment_Charge
0           10           Jim   54                  OPD             10874
1           13          John   28                  IPD             10951
2           12           Jim   60                  IPD              5816
3           10           Jim   56                  IPD              1851
9           18          Jack   48                  OPD              8387
..         ...           ...  ...                  ...               ...
95          12          Jill   55                  OPD              4262
96          11          John   22                  IPD               481
97          10          Jill   41                  OPD              5718
98          11          Jane   59                  OPD              1042
99          11          Jane   35                  OPD              5927

[70 rows x 5 columns]

In [41]:
df.head(5)

   Patient_ID Patient _name  Age Admitted typeon Type  Treatment_Charge
0          10           Jim   54                  OPD             10874
1          13          John   28                  IPD             10951
2          12           Jim   60                  IPD              5816
3          10           Jim   56                  IPD              1851
9          18          Jack   48                  OPD              8387

In [42]:
df["Admitted"] = np.where(
    (df["Age"]<=26) & (df["Patient_ID"] >=0), "yes", "No"
)

C:\Users\r\AppData\Local\Temp\ipykernel_4068\3376063210.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Admitted"] = np.where(

In [43]:
df

,Patient_ID,Patient _name,Age,Admitted typeon Type,Treatment_Charge,Admitted
0,10,Jim,54,OPD,10874,No
1,13,John,28,IPD,10951,No
2,12,Jim,60,IPD,5816,No
3,10,Jim,56,IPD,1851,No
9,18,Jack,48,OPD,8387,No
...,...,...,...,...,...,...
95,12,Jill,55,OPD,4262,No
96,11,John,22,IPD,481,yes
97,10,Jill,41,OPD,5718,No
98,11,Jane,59,OPD,1042,No
99,11,Jane,35,OPD,5927,No

In [52]:
# flag patients aged <=26 and admitted as IPD
df["Admitted Type"] = np.where(
    (df["Age"] <= 26) & (df["Patient_ID"] >= 0) & (df["Admitted Type"] == "IPD"),
    "yes",
    "No",
)

In [48]:
df

    Patient_ID Patient _name  Age Admitted Type Admitted Type=IPD
0           10           Jim   54           OPD                No
1           13          John   28           IPD                No
2           12           Jim   60           IPD                No
3           10           Jim   56           IPD                No
4           11          Jack   61           IPD                No
..         ...           ...  ...           ...               ...
95          12          Jill   55           OPD                No
96          11          John   22           IPD               yes
97          10          Jill   41           OPD                No
98          11          Jane   59           OPD                No
99          11          Jane   35           OPD                No

[100 rows x 5 columns]